app/controllers/top_controller.rb

  def show
    @text = Text.all
---
SELECT "texts".* FROM "texts"

  def create
    @texts = Text.new(text: params[:message])
    @texts.save
---
INSERT INTO "texts" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "fire 1"], ["created_at", "2019-03-03 01:48:17.074330"], ["updated_at", "2019-03-03 01:48:17.074330"]]